Catalogs/Обучающиеся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Обучающиеся</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительОбучающегося</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РодителиОбучающихся</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/УровниЗнанийОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>УровниЗнанийОбучающихся</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УровеньЗнаний</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниЗнаний</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИнформацияОбОбразовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ИнформацияОбОбразовании</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГодОбучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчебноеПособие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеПособия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПредпочтительныйТипЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПредпочтительныйТипЗанятий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипПроведенияЗанятий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроведенияЗанятий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РасценкиЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>РасценкиЗанятий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДлительностьЗанятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДлительностьЗанятий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Обучающиеся/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ЗаполнитьВводныеДанные();
		ЗаполнитьРасценкиЗанятий();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВводныеДанные()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИнформацияОбОбразованииСрезПоследних.УчебноеЗаведение,
	                      |	ИнформацияОбОбразованииСрезПоследних.ГодОбучения,
	                      |	ИнформацияОбОбразованииСрезПоследних.УчебноеПособие,
	                      |	ПредпочтительныйТипЗанятийСрезПоследних.ТипПроведенияЗанятий,
	                      |	УровниЗнанийОбучающихсяСрезПоследних.УровеньЗнаний
	                      |ИЗ
	                      |	Справочник.Обучающиеся КАК Обучающиеся
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УровниЗнанийОбучающихся.СрезПоследних(, Обучающийся = &Обучающийся) КАК УровниЗнанийОбучающихсяСрезПоследних
	                      |		ПО Обучающиеся.Ссылка = УровниЗнанийОбучающихсяСрезПоследних.Обучающийся
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнформацияОбОбразовании.СрезПоследних(, Обучающийся = &Обучающийся) КАК ИнформацияОбОбразованииСрезПоследних
	                      |		ПО Обучающиеся.Ссылка = ИнформацияОбОбразованииСрезПоследних.Обучающийся
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредпочтительныйТипЗанятий.СрезПоследних(, Обучающийся = &Обучающийся) КАК ПредпочтительныйТипЗанятийСрезПоследних
	                      |		ПО Обучающиеся.Ссылка = ПредпочтительныйТипЗанятийСрезПоследних.Обучающийся
	                      |ГДЕ
	                      |	Обучающиеся.Ссылка = &Обучающийся");
	Запрос.УстановитьПараметр("Обучающийся", Объект.Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ТипПроведенияЗанятий	= Результат.ТипПроведенияЗанятий;
		ГодОбучения				= Результат.ГодОбучения;
		УровеньЗнаний			= Результат.УровеньЗнаний;
		УчебноеПособие			= Результат.УчебноеПособие;
		УчебноеЗаведение		= Результат.УчебноеЗаведение;
	Конецесли;			
	
КонецПроцедуры

Процедура ЗаполнитьРасценкиЗанятий()

	ТаблицаЦен = РегистрыСведений.РасценкиЗанятий.ПолучитьРасценкиЗанятий(ПараметрыСеанса.ТекущийПользователь, Объект.Ссылка);
	
	Если ТаблицаЦен.Количество() > 0 Тогда
		Элементы.СтоимостьЗанятий.Заголовок = "";
		Для Каждого СтрЦена из ТаблицаЦен Цикл
			Элементы.СтоимостьЗанятий.Заголовок = Элементы.СтоимостьЗанятий.Заголовок + Строка(СтрЦена.Цена) + " / " + Строка(СтрЦена.ДлительностьЗанятия)+"  ";
		КонецЦикла;
	КонецЕсли;


КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаписатьТипЗанятий();
	
	ПредыдущийТипЗанятий = РегистрыСведений.ПредпочтительныйТипЗанятий.ПолучитьТипЗаниятй(Объект.Ссылка);
	Если ПредыдущийТипЗанятий <> ТипПроведенияЗанятий Тогда
		РегистрыСведений.ПредпочтительныйТипЗанятий.ЗаписатьТипЗанятий(Объект.Ссылка, ТипПроведенияЗанятий);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаписатьУровеньЗнаний();
	
	ПредыдущийУровеньЗнаний = РегистрыСведений.УровниЗнанийОбучающихся.ПолучитьУровеньЗнаний(Объект.Ссылка);
	Если ПредыдущийУровеньЗнаний <> УровеньЗнаний Тогда
		РегистрыСведений.УровниЗнанийОбучающихся.ЗаписатьУровеньЗнаний(Объект.Ссылка, УровеньЗнаний);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаписатьИнформациюОбОбразовании();
	
	ПредыдущаяИнформацияОбОбразовании = РегистрыСведений.ИнформацияОбОбразовании.ПолучитьИнформациюОбОбразовании(Объект.Ссылка);
	Если ПредыдущаяИнформацияОбОбразовании = Неопределено Тогда 
		РегистрыСведений.ИнформацияОбОбразовании.ЗаписатьИнформациюОбОбразовании(Объект.Ссылка, УчебноеЗаведение, ГодОбучения, УчебноеПособие);
	ИначеЕсли ПредыдущаяИнформацияОбОбразовании.ГодОбучения			<> ГодОбучения		ИЛИ
			  ПредыдущаяИнформацияОбОбразовании.УчебноеЗаведение	<> УчебноеЗаведение	ИЛИ
			  ПредыдущаяИнформацияОбОбразовании.УчебноеПособие		<> УчебноеПособие 	Тогда
		РегистрыСведений.ИнформацияОбОбразовании.ЗаписатьИнформациюОбОбразовании(Объект.Ссылка, УчебноеЗаведение, ГодОбучения, УчебноеПособие);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПроверитьИЗаписатьТипЗанятий();
	ПроверитьИЗаписатьУровеньЗнаний();
	ПроверитьИЗаписатьИнформациюОбОбразовании()
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦены(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда Сообщить("Необходимо записать элемент справочника!"); Возврат; КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Обучающийся", Объект.Ссылка);
	
	ОткрытьФормуМодально("РегистрСведений.РасценкиЗанятий.Форма.ФормаУстановкиЦен", ПараметрыФормы, ЭтаФорма);
	
	ЗаполнитьРасценкиЗанятий();
	
КонецПроцедуры
